{"/cv/":{"data":{"":"You can get my full CV here."},"title":"CV"},"/projects/":{"data":{"":" BymaData Api Wrapper Unofficial python wrapper for the BymaData API."},"title":"Projects"},"/projects/bymadata-api-wrapper/":{"data":{"":"Unofficial wrapper for the recently released BymaData API service. Developed by Matias Gleser.","features#Features":" Full support for all BymaData API services. Support for Python 3.6+ ","installation#Installation":"To install this module, run:\npip install git+https://github.com/matiasgleser/bymadata-api-wrapper.git "},"title":"BymaData API Wrapper"},"/projects/bymadata-api-wrapper/contributing/":{"data":{"":"If you encounter a bug or would like to see new features added there are several ways to contribute:\nFile an issue Submit a pull request. Email me "},"title":"Contribute"},"/projects/bymadata-api-wrapper/summary/":{"data":{"":"","wrapper-functions-and-corresponding-api-endpoints#Wrapper Functions and Corresponding API Endpoints":" Wrapper Function API Path Full API URI equity() equity api-mgr.byma.com.ar/{endpoint}/equity fixed_income() fixed_income api-mgr.byma.com.ar/{endpoint}/fixed_income futures() futures api-mgr.byma.com.ar/{endpoint}/futures options() options api-mgr.byma.com.ar/{endpoint}/options repos() collateralized_repos api-mgr.byma.com.ar/{endpoint}/collateralized_repos trading_lots() trading_lots api-mgr.byma.com.ar/{endpoint}/trading_lots loans() loans api-mgr.byma.com.ar/{endpoint}/loans indices() indices api-mgr.byma.com.ar/{endpoint}/indices turnover() turnover api-mgr.byma.com.ar/{endpoint}/turnover intraday_ops() intraday api-mgr.byma.com.ar/{endpoint}/intraday "},"title":"Summary"},"/projects/bymadata-api-wrapper/usage/":{"data":{"":"","available-paths#Available Paths":"For all endpoints, several paths are available:\nEquity Data # Equity Data sn.equity(ticker=None, settle_period=\"0003\", group=\"ACCIONES\", subgroup=None, operative_form=\"CONTADO\", currency=\"ARS\") Fixed Income Data # Fixed Income Data sn.fixed_income(ticker=None, settle_period=\"0003\", group=\"TITULOSPUBLICOS\", market=\"PPT\", operative_form=\"CONTADO\", currency=\"ARS\") Futures Data # Futures Data sn.futures(group=\"FUTMONEDAS\") Options Data # Options Data sn.options(ticker=None, currency=\"ARS\") Repos Data # Repos Data sn.repos(group=\"CAUCIONES\") Trading Lots Data # Trading Lots Data sn.trading_lots(group=\"PXL\", currency=\"ARS\") Loans Data # Loans Data sn.loans(group=\"PRESTAMOSV\", currency=\"ARS\") Indices Data # Indices Data sn.indices() Turnover Data Returns aggregate market turnover data.\n# Turnover Data sn.turnover() Intraday Operations Data Returns intraday operations for a security. A security can be determined by its security_id parameter or constructed by function parameters. If both are determined, security_id takes preference.\n# Intraday Operations Data sn.intraday_ops(ticker=None, settle_period=\"0003\", currency=\"ARS\", market=\"CT\", operative_form=\"C\", security_id=None) ","endpoints#Endpoints":"Three valid endpoints are allowed (Snapshot, Delayed, and EndOfDay). The client must ensure they have credentials that grant access to the specified endpoint.\nfrom bymadata_api_wrapper import SnapshotAPI, DelayedAPI, EndOfDayAPI # Specify client ID and client secret key to initialize sn = SnapshotAPI(client_id=\"\u003cClient ID\u003e\", client_secret=\"\u003cClient Secret Key\u003e\") # Snapshot endpoint delayed = DelayedAPI(client_id=\"\u003cClient ID\u003e\", client_secret=\"\u003cClient Secret Key\u003e\") # Delayed endpoint eod = EndOfDayAPI(client_id=\"\u003cClient ID\u003e\", client_secret=\"\u003cClient Secret Key\u003e\") # EndOfDay endpoint "},"title":"Usage"},"/research/":{"data":{"":"","publications#Publications":" Automated Market Makers and the optimal implementation for CBDCs (in spanish)\nCentral Bank of Argentina (Second Prize, 2023 Annual Dissertation Award for Economic Research “Dr. Raúl Prebisch”)\nAbstract: The creation of Bitcoin in 2008 demonstrated the possibility of creating virtual money backed solely by trust in the issuance algorithm, rather than a central monetary authority. Additionally, blockchain technology for transaction recording gained popularity and sparked innovations in its application. The most significant of these innovations came with Ethereum in 2014, a blockchain that not only supported its cryptocurrency (Ether) but also enabled the creation of smart contracts. Smart contracts on Ethereum quickly found applications in the development of stable cryptocurrencies, or Stablecoins, and later in decentralized markets for cryptocurrency trading. These decentralized markets faced the challenge of being unable to replicate the mechanisms used in traditional financial systems, particularly the order book, and had to turn to algorithms to find solutions. From this search emerged Automated Market Makers (AMMs), capable of providing liquidity at a price determined algorithmically. Subsequently, various types of AMMs were designed, each with distinct properties, in an attempt to provide the definitive solution for anonymous trading in systems without a central authority. Alongside the growth and mainstream adoption of cryptocurrencies and their blockchain-based applications, governments around the world, particularly their central banks, began exploring the possibility of basing their economies on so-called Central Bank Digital Currencies (CBDCs). This work aims to outline the main types of algorithms put into operation, highlight some of their properties, and finally propose the use of a specific implementation for central banks’ virtual currencies that allows for a certain degree of freedom in determining monetary policy, particularly with regard to exchange rate policy."},"title":"Research"},"/teaching/":{"data":{"":"","undergraduate#Undergraduate":" Economics I (TA), Universidad Torcuato Di Tella First semester (2024, 2025) Statistics III (TA), Universidad Nacional de Córdoba First semester (2021, 2022)\nMicroeconomics III (TA), Universidad Nacional de Córdoba First semester (2021, 2022, 2023)\nMonetary Economics (TA), Universidad Nacional de Córdoba First semester (2022, 2023)\nMacroeconomics I (TA), Universidad Nacional de Córdoba First semester (2022, 2023)"},"title":"Teaching"}}